Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.PartMarkPropertyElementTypes Class
 The PartMarkPropertyElementTypes class represents the available property element types for part marks.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PartMarkPropertyElementTypes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public static class PartMarkPropertyElementTypes
<SerializableAttribute>
Public NotInheritable Class PartMarkPropertyElementTypes
The PropertyElement.PropertyElementType.PartMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
AssemblyPosition
Returns the assembly position property element type.
Camber
Returns the camber property element type.
CenterToCenterDistance
Returns the center-to-center distance property element type.
Class
Returns the class property element type.
FaceDirection
Returns the face direction property element type.
Finish
Returns the finish property element type.
FittingsNsFs
Returns the fittings (NS/FS) property element type.
GageOfOutstandingLeg
Returns the gage of the outstanding leg property element type.
Length
Returns the length property element type.
Material
Returns the material property element type.
Name
Returns the name property element type.
PartPosition
Returns the part position property element type.
Profile
Returns the profile property element type.
RotationAngle
Returns the rotation angle property element type.
Size
Returns the size property element type.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace